-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1:3307
-- 產生時間： 2023-01-03 05:55:57
-- 伺服器版本： 10.4.25-MariaDB
-- PHP 版本： 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `monopoly`
--

DELIMITER $$
--
-- 函式
--
CREATE DEFINER=`monopoly_admin`@`%` FUNCTION `count_player` (`identity` INTEGER) RETURNS INT(11)  begin
                    declare p_count integer;
                    SELECT count(player_id) into p_count 
                    FROM player 
                    WHERE player.identity = identity;
                    return p_count;
                end$$

DELIMITER ;

-- --------------------------------------------------------

--
-- 資料表結構 `character_list`
--

CREATE TABLE `character_list` (
  `character_id` int(11) NOT NULL,
  `img` varchar(255) NOT NULL,
  `character_name` varchar(255) NOT NULL,
  `character_info` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `character_list`
--

INSERT INTO `character_list` (`character_id`, `img`, `character_name`, `character_info`) VALUES
(1, '角色1掛角', '掛角', '<h3>喜愛糖葫蘆的女子</h3><p>熱情又帶點痞痞的個性<br>想引人注目<br>所以染了鮮豔的粉紅辮子<br>手裡總是拿著一串糖葫蘆</p>'),
(2, '角色2莯沐', '莯沐', '<h3>台灣一間茶館的老闆</h3><p>曾在唐人街生活<br>在館內隨時帶著茶壺<br>個性謹慎穩重<br>但臨機應變能力不足</p>'),
(3, '角色3特雷文', '特雷文', '<h3>俄羅斯傭兵</h3><p>喜歡小熊造型的物品<br>用烈酒醃過的肉製品<br>身上總是背著烤串<br><br></p>'),
(4, '角色4陳冠宇', '陳冠宇', '<h3>台灣高中生</h3><p>喜歡路邊攤炸物<br>身上常有胡椒粉味<br>隨身攜帶MP3<br>偶像是饒舌歌手</p>'),
(5, '角色5林夏在', '林夏在', '<h3>喜愛喝手搖飲的男子</h3><p>悶騷 自卑<br>但同時某些方面超自戀<br>有時會說出不符年齡的老態發言<br>沒有邏輯的話</p>'),
(6, '角色6葡萄', '葡萄', '<h3>ㄎㄧㄤㄎㄧㄤ的瞌睡蟲</h3><p>葡萄吃太多<br>所以變成鮮豔的紫色布丁頭<br>常常無所事事<br>總是一不小心就打瞌睡</p>'),
(7, '角色7希椏', '希椏', '<h3>蝦子魔人</h3><p>希椏念快一點就變蝦<br>去蒸鮮都只吃蝦子壽司<br>喜歡拉拉熊<br>總是拉著他的熊熊</p>'),
(8, '角色8不會冷', '不會冷', '<h3>每天都像夏天</h3><p>一年四季都穿短袖短裙<br>上輩子可能是企鵝所以不會冷<br>舌頭很短<br>常常哈哈大笑</p>');

-- --------------------------------------------------------

--
-- 資料表結構 `map_info`
--

CREATE TABLE `map_info` (
  `map_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` int(11) NOT NULL,
  `discription` varchar(225) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `map_info`
--

INSERT INTO `map_info` (`map_id`, `name`, `price`, `discription`) VALUES
(1, 'Start', 50000, '又回到這裡了呢!'),
(2, 'Gummy', 700000, '巧克力裡面包著QQ的軟糖，有誰沒吃過呢?'),
(3, '小熊軟糖', 600000, '1個、2個、3個...黃色那位你要去哪裡?'),
(4, 'pocky', 1200000, 'Share happiness! Pocky～分かち合うって、いいね！～'),
(5, '維力', 800000, '同學，不好意思，可以請你坐遠一點嗎?'),
(6, '洋芋球', 2000000, '一口咬下馬鈴薯香氣好幸福~'),
(7, '雪餅', 3000000, '甜中帶鹹，鹹中帶甜，大人小孩都愛☆'),
(8, 'Maltesers', 3500000, '酥脆香濃的美味巧克力球，一吃就停不了口'),
(9, '可愛的家', 500000, '可愛的家是溫暖的小窩還是巫婆的糖果屋呢?'),
(10, '奇多', 500000, 'cheetos!!'),
(11, '小熊餅乾', 600000, '我的名字是March君喔! &nbsp;&nbsp;還有我!我叫華爾滋妹!'),
(12, '旺旺仙貝', 1200000, '拜拜時總少不了它，「旺旺拜拜，真是旺旺」!'),
(13, '浪味先', 800000, '浪~味~先~~ &nbsp;讓你快樂似神仙~~~'),
(14, '蝦味先', 2000000, '「蝦味先，呷袂先」'),
(15, '足球巧克力', 3000000, '足球外觀的巧克力有一個可愛的名字叫「哈哈球」'),
(16, '新貴派', 3500000, '酥脆威化與香濃顆粒花生醬，淋上濃郁的巧克力，豐富口感，帶來滿滿正能量！'),
(17, '洋芋片', 1500000, '你喜歡原味還是海苔味? &nbsp;&nbsp;...我喜歡蚵仔煎口味的!'),
(18, '飲料店', 500000, '嗯...我要一杯鐵觀音拿鐵，微糖去冰'),
(19, 'Oreo', 500000, '轉一轉，舔一舔...接下來你們會的對吧?'),
(20, '牛肉乾', 600000, '我嚼...我嚼...'),
(21, 'Kitkat', 1200000, 'Have a Break，Have a Kit Kat'),
(22, '飛機餅乾', 800000, '小小的飛機，載著童年的回憶'),
(23, '水果乾', 2000000, '很好吃!! &nbsp;除了番茄乾...噁...'),
(24, '健達', 3000000, '牛奶巧克力加上威化外層, 含綿滑牛奶及榛果內餡。獨特口感，多重享受'),
(25, '牛舌餅', 3500000, '香香甜甜~ &nbsp;能甜到心裡去~'),
(26, '休息一下', 500000, '我想來一份休息套餐!!'),
(27, '玉米濃湯棒', 500000, '濃郁的玉米濃湯味，鹹鹹甜甜好刷嘴'),
(28, '棒棒糖', 600000, '哇哈哈--我的是葡萄味的!'),
(29, '曲奇', 1200000, '我不管! &nbsp;巧克力的才是最好吃的!'),
(30, 'Nutella', 800000, '我要致死量的醬!'),
(31, '雪Q餅', 2000000, '你知道嗎? 我的前身是棉花糖餅乾喔'),
(32, '爆米花', 3000000, '我就是電影院愛情片的電燈泡!'),
(33, '七七乳加', 3500000, '嚕加嚕好呷--七七乳加'),
(34, '果凍', 1500000, '齜溜---');

-- --------------------------------------------------------

--
-- 資料表結構 `player`
--

CREATE TABLE `player` (
  `player_id` varchar(255) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `identity` int(11) NOT NULL,
  `player_name` varchar(255) NOT NULL,
  `character_id` int(11) DEFAULT NULL,
  `win` int(11) DEFAULT NULL,
  `lost` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `player`
--

INSERT INTO `player` (`player_id`, `password_hash`, `identity`, `player_name`, `character_id`, `win`, `lost`) VALUES
('1', '$2y$10$LtHLX5PL.How9AxpP34lxe3QVuoVR1IqctzYZES7oH59R6jsgzDWq', 1, '林宸希', NULL, 0, 0),
('111', '$2y$10$LIQ8HBL4v4.n9yU.qDstbOcNSrM2sVYHV2mMz7NIoWZfSFu/DT7Fm', 1, '林宸希', 2, 0, 0),
('1111', '$2y$10$JGGm3Ex8XqWux9ChPoPCCOeEnJ6oAY.RoqNgI37EOL/VAWpJ6hGTe', 1, '林宸希', NULL, 0, 0),
('bb', '$2y$10$KddGWmOOQTWWDV8F1fV2GuXbgC94VqU0VipXJZRQ08SZTDgqBmvDW', 1, 'bb', NULL, 0, 0),
('cc', '$2y$10$nYPsAjJs3tdmzDPpCRhHnuPRbt2/pn95Kt58fYpkKB//5QYO0p.5O', 1, 'cc', NULL, 0, 0),
('dd', '$2y$10$3csmtBEWohS/o8VrPEWc1.vxL4b.U1C..6Ha7v9YqLqfhl.af7R3S', 1, 'dd', NULL, 0, 0),
('master', '$2y$10$zoYb5/rxDdydQXlvDe9svugNkLynZwZ4jtGjL5ZsZEXvfmCoFtgHm', 0, 'master', NULL, 0, 0),
('sunny0809', '$2y$10$vMw97lrxzLXiLXknYCeLVOtpcQCa5yyw8LKYjZgqAwFeBlR.Qzff2', 1, '林宸希', 8, 0, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `qustion`
--

CREATE TABLE `qustion` (
  `question_id` int(11) NOT NULL,
  `description` varchar(255) NOT NULL,
  `option_A` varchar(255) NOT NULL,
  `option_B` varchar(255) NOT NULL,
  `option_C` varchar(255) NOT NULL,
  `option_D` varchar(255) NOT NULL,
  `answer` varchar(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `qustion`
--

INSERT INTO `qustion` (`question_id`, `description`, `option_A`, `option_B`, `option_C`, `option_D`, `answer`) VALUES
(1, '請問列何者是製作小魚乾常使用的魚?', '鮪魚', '鯷魚', '沙丁魚', '鯖魚', 'B'),
(2, '請問潮州名菜中有道把香蕉中間放冬瓜糖拿去油炸的料理名為?', '心太軟', '不落夾', '三不沾', '來不及', 'D'),
(3, '請問下列何者不是威靈頓牛排的材料?', '菲力', '起司', '酥皮', '鵝肝醬', 'B'),
(4, '請問下列何者是牧羊人派的主要材料?', '馬鈴薯', '地瓜', '米', '山藥', 'A'),
(5, '請問哪種麵包產自俄羅斯?', '可頌', '班諾克', '佛卡夏', '大列巴', 'D'),
(6, '請問第一碗在日本販售的拉麵口味是?', '醬油', '豚骨', '鹽味', '味噌', 'C'),
(7, '請問哪個不是韓式涼拌小菜?', '酸筍', '涼拌黃豆芽', '辛奇', '醃蘿蔔', 'A'),
(8, '請問2022世界巧克力大賽在幾月舉辦?', '11', '7', '8', '10', 'A'),
(9, '阿拉伯小吃沙威瑪源於土耳其文「çevirme」，請問çevirme的意思是?', '烤肉', '夾心', '堆疊', '旋轉', 'D'),
(10, '請問沙其馬源於哪個國家?', '土耳其', '中國', '台灣', '匈牙利', 'B'),
(11, '請問披薩曾經是哪個區域的窮人主食?', '威尼斯', '拿坡裡', '西西里島', '比薩', 'B'),
(12, '請問哪個是「全球十大黑暗料理」前三名?', '鯡魚罐頭', '黑布丁', '皮蛋', '炸蜘蛛', 'C'),
(13, '請問含水30%以上的和菓子是?', '生菓子', '半生菓子', '乾菓子', '熟菓子', 'A'),
(14, '請問可樂是什麼人發明的?', '商人', '鞋匠', '農民', '藥師', 'D'),
(15, '請問巴西國菜「腓秀雅雜」指的是?', '起司麵包球', '椰奶燴蝦', '炸雞肉包', '黑豆肉粒飯', 'D'),
(16, '請問下列哪個不是泰式三大咖哩?', '青咖哩', '紅咖哩', '黃咖哩', '白咖哩', 'D'),
(17, '請問日本料理中，「鱈魚白子」是鱈魚的哪個部位?', '精囊', '眼珠', '腸子', '卵', 'A'),
(18, '請問哪個不是挪威美食?', '風干鹹羊排', '駝鹿肉', '黑布丁', '鯨魚肉', 'C'),
(19, '請問蛋腸是台灣哪個縣市的限定美食?', '新北', '基隆', '苗栗', '台南', 'B'),
(20, '請問法國的傳統食物「國王派」通常在哪天享用?', '1/1', '1/6', '1/7', '1/25', 'B'),
(21, '請問果凍花起源於?', '法國', '日本', '西班牙', '馬來西亞', 'C'),
(22, '請問埃及美食「鳥舌湯」的由來?', '加入巫婆鳥的舌頭製成', '傳聞中神話貝努鳥的祭祀品', '麵粉形似鳥舌而命名', '從海商帶來的鳥舌蘭發想而出', 'C'),
(23, '印度料理Thali指的是米或烤餅配上許多小碗沾醬的套餐，請問Thali在印度語中是什麼意思?', '沾醬', '大盤子', '選擇', '雜燴', 'B'),
(24, '請問下列哪種火腿最有韌性?', '伊比利火腿', '金華火腿', '黑森林火腿', '壓型火腿', 'A'),
(25, '請問荷蘭小鬆餅通常加入什麼餡料?', '果醬', '乳酪', '巧克力', '不加入餡料', 'D'),
(26, '請問丹麥料理魔鬼太陽是?', '生牛肉+生蛋黃', '熟牛肉+生蛋黃', '生牛肉+熟蛋黃', '熟牛肉+熟蛋黃', 'A'),
(27, '請問「布林餅」是俄羅斯哪個傳統節日的必備美食?', '謝肉節', '紅帆節', '洗禮節', '樺樹節', 'A'),
(28, '請問下列不是西安名菜「明四喜」的四喜之一?', '洞房花燭夜', '金榜題名時', '久旱逢甘霖', '他鄉遇老師', 'D'),
(29, '費南雪又稱做什麼?', '瑪德蓮', '金磚蛋糕', '磅蛋糕', '杏仁圓蛋糕', 'B'),
(30, '請問下列何者不是世界三大湯頭之一?', '馬賽魚湯', '上湯', '羅宋湯', '冬陰湯', 'C'),
(31, '亡靈麵包是墨西哥什麼節日吃的麵包?', '三王節', '革命日', '亡靈節', '瓜達魯佩聖母日', 'C'),
(32, '卡塔耶夫是齋月期間埃及人最喜愛的甜點之一，也被稱為中東薄餅，會放入葡萄乾、堅果並蘸著蜂蜜吃，請問其烹飪手法是?', '煎', '烘烤', '油炸', '蒸', 'C'),
(33, '歐培拉(Gâteau opéra)是一種夾有咖啡糖漿和巧克力醬的杏仁奶油蛋糕，又被稱為?', '千層蛋糕', '大理石蛋糕', '拿破崙蛋糕', '歌劇院蛋糕', 'D'),
(34, '潘多洛麵包是一種義大利耶誕節慶甜品，表面呈金黃色，因加入大量的蛋黃口感近似於蛋糕，所以又稱?', '蛋糕麵包', '六角星麵包', '黃金麵包', '雪山麵包', 'C'),
(35, '甘納許是一種在失敗中誕生的巧克力，傳聞有位學徒在製作甜品時，不小心在巧克力中倒入了過多的牛奶，於是被師傅大罵了一聲甘納許，請問甘納許意思是?', '笨蛋', '天才', '廢物', '平庸', 'A'),
(36, '桃花酥是一款宮廷點心，請問它的顏色是?', '白色', '粉色', '紅色', '黃色', 'B'),
(37, '請問下列何者不是中國名菜「臘味合蒸」的內容?', '臘豬肉', '臘牛肉', '臘雞', '臘魚', 'B'),
(38, '請問源自東倫敦的菜餚「鱔魚凍」通常會搭配什麼食用?', '醬油', '毛豆', '馬鈴薯泥', '白米', 'C'),
(39, '請問鹽甘草糖因含有氯化銨，所以有什麼味道?', '菸草', '瓦斯', '消毒水', '燒仙草', 'C'),
(40, '請問瑞典的「全國肉桂麵包捲日」在?', '5/13', '12/25', '8/8', '10/4', 'D'),
(41, '請問正宗羅宋湯以甜菜为主料，因此呈現什麼色?', '紫红色', '金黃色', '奶白色', '碧綠色', 'A'),
(42, '「戰斧牛排」又叫「帶骨眼肉」，請問其部位是?', '菲力', '沙朗', '紐約客', '肋眼', 'D'),
(43, '請問下列何者不是日本過年傳統食物?', '蕎麥麵', '鏡餅', '御節料理', '生魚片', 'D'),
(44, '約克郡布丁是英國的傳統食品，被稱為是英國女王最愛的食物之一，請問約克郡布丁其實是一種?', '蛋糕', '麵包', '吐司', '水果塔', 'B'),
(45, '請問肉骨茶材料不包含?', '香料', '排骨', '茶葉', '藥材', 'C'),
(46, '請問貝果的發源地是?', '奧地利', '美國', '中國', '紐西蘭', 'A'),
(47, '請問何者是紐西蘭美食?', '班尼迪克蛋', '葡萄酒', '炒麵', '生蚝', 'D'),
(48, '請問泡麵發源地是?', '韓國', '新加坡', '中國', '日本', 'D'),
(49, '菲達乳酪原產自希臘，要以綿羊奶製作，口感綿滑、柔軟、細緻，需要浸泡鹽水保存，是一種?', '硬質乳酪', '藍黴乳酪', '軟質熟成乳酪', '軟質新鮮乳酪', 'D'),
(50, '請問石鍋拌飯顏色繽紛，下列何者不屬於以韓國人篤信的「五行說」中的一色?', '紅', '綠', '白', '橙', 'D'),
(51, '慕尼黑白香腸又稱巴伐利亞白香腸，由剁碎的小牛肉和煙豬肉製做，因為它是用食鹽而不是亞硝酸鹽製成的，顏色呈?', '酒紅色', '灰白色', '淺黃色', '黑色', 'B'),
(52, '請問下列何者不是「西方三大珍饈」?', '魚子醬', '藏紅花', '松露', '鵝肝', 'B'),
(53, '薩芭雍是義大利的一種甜品，是用雞蛋混合奶油，甜酒，澆在各式各樣水果上著名的宮廷代表作，請問甜酒是指?', '朗姆酒', '利口酒', '雪莉酒', '蛋奶酒', 'A'),
(54, ' 史多倫麵包(Stollen)是德國的一種麵包，它的麵包體象徵著繈褓中的耶穌，其特色為麵包中加入各色酒漬果乾，請問是德國何種節日的必吃麵包?', '萬聖節', '復活節', '聖誕節', '新年', 'C'),
(55, '請問生煎包又被稱為?', '生煎饅頭', '水煎包', '口袋餅', '饢', 'A'),
(56, '八寶飯是一道江南蒸制名點，請問下列何者不是其原材料?', '糯米', '蓮心', '枸杞', '豆沙', 'C'),
(57, '可頌是法文Croissant的音譯，請問Croissant是指?', '奶油', '金色', '新月', '焦糖', 'C'),
(58, '請問下列何者不是熱狗別稱?', '德國香腸', '法蘭克福香腸', '燻肉香腸', '維也納香腸', 'A'),
(59, '煎餅果子是天津的著名小吃，以什麼為主料，調成糊狀，攤成煎餅?', '黃豆粉', '綠豆粉', '黑豆粉', '紅豆粉', 'B'),
(60, '請問下列何者不是台灣夜市小吃豬血糕的別稱?', '米血糕', '豬血粿', '明賢', '鴨血糕', 'D'),
(61, '請問月亮蝦餅源自於?', '越南', '台灣', '韓國', '泰國', 'B'),
(62, '請問打拋豬的特殊風味來自於?', '九層塔', '迷迭香', '打拋葉', '馬告', 'C'),
(63, '請問棒棒糖發源地是?', '葡萄牙', '美國', '英國', '西班牙', 'D'),
(64, '請問下列何者不是加拿大國菜「波蘭餃子」的別稱?', '斯洛伐克餃子', '烏克蘭餃子', '俄國餃子', '西伯利亞餃子', 'A'),
(65, '裝滿肉碎或肉粒和濃郁肉汁的鹹派，大小永遠不會超出手掌可捧握的範圍，屬於哪國美食?', '澳洲', '美國', '西班牙', '英國', 'A'),
(66, '沙嗲又名沙嗲串燒、沙嗲串，是一種東南亞的烤肉串，其起源於?', '越南', '馬來西亞', '印尼', '泰國', 'C'),
(67, '卡雷卡雷是菲律賓的一種燉菜，味道鹹中帶甜，請問它是用牛尾和什麼醬燉成?', '草莓醬', '花生醬', '巧克力醬', '沙茶醬', 'B'),
(68, '請問全台唯一獲得米其林三星的餐廳是哪一間?', '山海樓', '頤宮', '鼎泰豐', '教父牛排', 'B'),
(69, '請問台中在地美食「麻薏」綠色湯底 + 地瓜，試問其原料為何?', '地瓜葉', '菠菜', '黃麻', '大陸妹', 'C'),
(70, '請問太陽餅的由來是什麼', '狼吞日製餅驅逐', '狀似太陽而名之', '祭祀太陽神--阿波羅', '萬金餅招親', 'B'),
(71, '請問新竹米粉風乾是因為何種方位的風?', '西南', '西西南', '東北', '東南', 'C'),
(72, '請問台灣哪條街的芒果冰最有名?', '迪化街', '新豐街', '中康街', '永康街', 'D'),
(73, '請問著名的辛香料「馬告」是下列哪一族對它的稱呼?', '阿美族', '鄒族', '泰雅族', '排灣族', 'C'),
(74, '請問知名的飲料「廟口紅茶」在哪裡?', '花蓮廟口', '基隆廟口', '高雄廟口', '新竹廟口', 'A'),
(75, '請問黑松露冬季or夏季 白松露冬季or夏季 何者最昂貴?', '黑松露夏季', '白松露冬季', '白松露夏季', '黑松露冬季', 'B'),
(76, '請問知名廟口夜市美食「鼎邊銼」的「銼」是甚麼意思?', '用鍋鏟把東西鏟起', '液體物爬滾的動作', '搓揉麵團', '一面烤一面炒', 'B'),
(77, '請問淡水知名小吃「阿給」的由來?', '將賣剩下的食材包在油豆腐中', '一位名叫「阿給」的人的拿手菜', '淡水以前舊稱為「阿給」', '一位日本人引進台灣的家鄉菜', 'A'),
(78, '請問台灣特色街頭小吃「肉圓」的發源地在哪裡?', '台中', '高雄', '新竹', '彰化', 'D'),
(79, '請問「甜不辣」一詞的由來?', '味道甜而不辣', '從日本傳來的音譯', '葡萄牙語的速食之意', '西班牙語的速食之意', 'C'),
(80, '請問台灣之光--鼎泰豐的小籠包有幾個皺褶', '18', '19', '20', '21', 'A');

-- --------------------------------------------------------

--
-- 替換檢視表以便查看 `userinfo`
-- (請參考以下實際畫面)
--
CREATE TABLE `userinfo` (
`player_id` varchar(255)
,`player_name` varchar(255)
,`win` int(11)
,`lost` int(11)
,`character_id` int(11)
,`character_name` varchar(255)
);

-- --------------------------------------------------------

--
-- 檢視表結構 `userinfo`
--
DROP TABLE IF EXISTS `userinfo`;

CREATE ALGORITHM=UNDEFINED DEFINER=`monopoly_admin`@`%` SQL SECURITY DEFINER VIEW `userinfo`  AS SELECT `player`.`player_id` AS `player_id`, `player`.`player_name` AS `player_name`, `player`.`win` AS `win`, `player`.`lost` AS `lost`, `player`.`character_id` AS `character_id`, `character_list`.`character_name` AS `character_name` FROM (`player` left join `character_list` on(`player`.`character_id` = `character_list`.`character_id`)) WHERE `player`.`identity` = 11  ;

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `character_list`
--
ALTER TABLE `character_list`
  ADD PRIMARY KEY (`character_id`);

--
-- 資料表索引 `map_info`
--
ALTER TABLE `map_info`
  ADD PRIMARY KEY (`map_id`);

--
-- 資料表索引 `player`
--
ALTER TABLE `player`
  ADD PRIMARY KEY (`player_id`),
  ADD KEY `customer_id` (`character_id`);

--
-- 資料表索引 `qustion`
--
ALTER TABLE `qustion`
  ADD PRIMARY KEY (`question_id`);

--
-- 已傾印資料表的限制式
--

--
-- 資料表的限制式 `player`
--
ALTER TABLE `player`
  ADD CONSTRAINT `player_ibfk_1` FOREIGN KEY (`character_id`) REFERENCES `character_list` (`character_id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
